app/Controllers/catalogo_controller.php

    public function catalogo()
    {
        // Instancio moto_model y llamo a función
        $motoModel = new moto_model();
        $motos = $motoModel->findAll();
---
SELECT *
FROM `moto`