app/Controllers/moto_controller.php

    public function obtenerMotos() {
        // Creo instancia del modelo
        $motoModel = new moto_model();

        // Recupero todos los registros
        $motos = $motoModel->findAll();
---
SELECT *
FROM `moto`