app/Controllers/reserva_controller.php

    public function comprobacion_reserva($idMoto) {
        // Obtener la sesión del usuario
        $session = session();

        // Verificar si el usuario está logueado
        if (!$session->get('logged_in')) {
            return redirect()->to('/login');
        }

        // Cargar el modelo de motos
        $motoModel = new moto_model();
        $moto = $motoModel->find($idMoto);
---
SELECT *
FROM `moto`
WHERE `moto`.`idMoto` = '1'